back/app/Controllers/Cantantes.php

    public function create()
    {



        $cantante = new $this->model;

        $id = $cantante->insert([
            'nombre'     => $this->request->getPost('nombre'),
            'apellido'   => $this->request->getPost('apellido'),
            'nacimiento' => $this->request->getPost('nacimiento'),
            'Biografia'  => $this->request->getPost('Biografia'),
        ]);
---
INSERT INTO `cantantes` (`nombre`, `apellido`, `nacimiento`, `Biografia`) VALUES ('prueba2', 'sss', 'carrillo', 'nemmeme')

    public function update($id = null)
    {

        $cantanteDB = $this->model->find($id);

        if (!$cantanteDB) {
            return $this->genericResponse(null, "El cantante solicitado no fue encontrado", 500);
        }

        $cantante = new $this->model;

        $data = $this->request->getRawInput();

        $cantante->update($id, [
            'nombre'     => $data['nombre'],
            'apellido'   => $data['apellido'],
            'nacimiento' => $data['nacimiento'],
            'Biografia'  => $data['Biografia'],
        ]);
---
UPDATE `cantantes` SET `nombre` = 'J valbin', `apellido` = 'gimenez', `nacimiento` = '1985', `Biografia` = 'José Álvaro Osorio Balvin, ​ conocido por su nombre artístico J Balvin, es un rapero, cantante y productor colombiano, reconocido como uno de los artistas latinos más vendidos del mundo, con ventas de treinta y cinco millones de álbumes y sencillos a nivel mundia'
WHERE `cantantes`.`id` IN ('3')

    public function delete($id = null)
    {

        $cantante = $this->model->delete($id);
---
DELETE FROM `cantantes`
WHERE `id` IN ('7')